{"projectList":[{"id":"0","title":"DataCycle","tags":"AngularJS, MongoDB, Node, Express, D3, Data Visualisation","src":"build/img/projects/datacycleL2.jpg","live":"http://datacycle.evennode.com/","code":"https://github.com/Michael2Gray","info":"DublinBikes was introduced in 2009 by Dublin City Council, since then there has been a rise of bike transportation in Dublin. The intention of this project was to investigate the use of web technologies to develop an application that provides users with the most recent and relevant DublinBikes information. This web application demonstrates the need for the visualization of this data and how it will improve the usability of DublinBikes. The application was developed using “MEAN Stack Development”, this stands for MongoDB, Express, Angular and Node. The application also uses the nvD3 charting library to visualise the data. The combination of these web technologies has led to the development of a web application that gives a clear and informative representation of the DublinBikes information. Through the research carried out for this project it was found that the implementation of this application was a benefit to users. There are a number of stations around the city that are underutilized and a number of stations that require extra bike and/or space availability.","member1Name":"Michael Gray","member1Link":"http://michael-gray.me/","member2Name":" ","member2Link":" ","member3Name":" ","member3Link":" ","member4Name":" ","member4Link":" "},{"id":"1","title":"Camp Danger","tags":"HTML5, JavaScript, ImpactJS","src":"build/img/projects/campDangerL2.jpg","live":"projects/cd/campDanger.html","code":"https://github.com/Michael2Gray","info":"This Project was undertaken by myself and a fellow student as part of our 3rd year dissertation at IADT. The aim of this project was to create a HTML5 and JavaScript game with a focus on game functionality and graphical experience. This dissertation explores the implementation of a HTML5 and JavaScript game using a game engine. The chosen game engine for this implementation is ImpactJS. We created an adventure platform style game called Camp Danger.","member1Name":"Michael Gray, ","member1Link":"http://michael-gray.me/","member2Name":"David Galligan","member2Link":"http://davidgalligandesigns.com/","member3Name":" ","member3Link":" ","member4Name":" ","member4Link":" "},{"id":"2","title":"Audio Visualiser","tags":"Canvas, JavaScript, Web Audio API, Data Visualisation","src":"build/img/projects/audioL2.jpg","live":"projects/audio/index.html","code":"https://github.com/Michael2Gray","info":"This application was developed to experiment, with the new Canvas Element. An Audio Viualiser was made using the Web Audio API. FX filters can be applied to the audio and visualisations are made depending on the frequency.","member1Name":"Michael Gray","member1Link":"http://michael-gray.me/","member2Name":"","member2Link":"","member3Name":" ","member3Link":" ","member4Name":" ","member4Link":" "},{"id":"3","title":"SAP Innovation JAM","tags":"HANA, JavaScript, Bootstrap","src":"build/img/projects/sapL2.jpg","live":"projects/sap/index.html","code":"https://github.com/Michael2Gray","info":"SAP Student InnoJam. Dream it. Invent it. Build it. I attended an over night event at the SAP Dublin AppHaus where I was a part of a team of 4 who were given the task to build an application from concept to working product in 24 hours. This involved being introduced for the first time for the SAP HANA platform and other technologies such as oData. We were given access to data sets which had 1 month of GPS Data of Dublin bus, Bus stops served by Dublin Bus, Traffic cameras and Noise Maps.Working within a very steep learning curve my team managed to produce a web and mobile application that would give notification by text as to when the user should leave his/her destination to catch a bus on time from a selected stop in order to reach the users selected destination at his/her requested time. This was achieved through a number of calculations which worked out the correct time for the user to leave based on a user inputted notification period and the real time position of the most relevant bus. I really enjoyed this event and as a result I realised that working under severe time constraints, no sleep and with new technologies within a team was something that I could endure and perform well within. Unfortunatley we do not hace access to the HANA platform anymore so a live version cannot be shown fully working.","member1Name":"Michael Gray, ","member1Link":"http://michael-gray.me/","member2Name":"David Way, ","member2Link":"http://davidway.me/","member3Name":"Emer Mooney, ","member3Link":"http://emerparnellmooney.com/","member4Name":"Leigh Martindale","member4Link":"https://www.linkedin.com/in/leighmartindale"},{"id":"4","title":"Vermilion","tags":"Bootstrap, CSS3, HTML5","src":"build/img/projects/vermilionL2.jpg","live":"http://www.vermiliondublin.com/","code":"","info":"Vermilion Restaurant is located in Terenure. The owners required a website to display there menus and relevant information to their customers. The website was built using the Bootstrap framework.","member1Name":"Michael Gray, ","member1Link":"http://michael-gray.me/","member2Name":"David Galligan","member2Link":"http://davidgalligandesigns.com/","member3Name":" ","member3Link":" ","member4Name":" ","member4Link":" "},{"id":"5","title":"Cracked Nut","tags":"Drupal CMS","src":"build/img/projects/crackedNutL2.jpg","live":"progress.html","code":"","info":"This project was built using the Drupal CMS as part of my time as a Research Assistant with IADT. The website needed full frontend and backend development, along with a administration area. The website was built to allow for online ordering of the food that Cracked Nut provide. There were multiple menu options and the website needed to cater for corporate customers as well.","member1Name":"Michael Gray","member1Link":"http://michael-gray.me/","member2Name":"","member2Link":"","member3Name":" ","member3Link":" ","member4Name":" ","member4Link":" "},{"id":"6","title":"Interactive Museum Application","tags":"Adobe Flash, ActionScript","src":"build/img/projects/museumL2.jpg","live":"projects/museum/index.swf","code":"","info":"This project was using Adobe Flash, the Nationl Maritime Museum asked students of IADT to develop an interactive application that represented a piece of the Museum. This application was developed by myself and a fellow student, we targeted a younger generation, in hopes that it would give them an enjoyable and informative experience.","member1Name":"Michael Gray, ","member1Link":"http://michael-gray.me/","member2Name":"David Galligan","member2Link":"http://davidgalligandesigns.com/","member3Name":" ","member3Link":" ","member4Name":" ","member4Link":" "}]}